- 分组
    - 对谁进行分组（group），就是对谁进行reduce（聚合），这些都会变成 distinct；
- dataframe
    - index/columns：都可以是 multiple 的
- pivot table：数据透视表，适用于 categorical 型数据
    - pivot: 枢轴/支点
    - 增强版的分组聚合：summarize & aggregate
        - index 可以是 list
    - 理解为一个矩阵，index 表示行索引，column 表示列索引，value 则是对应的 entry 的值；
    - 对 values 默认的聚合函数是 `aggfunc: AggFuncType = "mean"`

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('./data/athlete_events.csv')

In [3]:
df.shape

(271116, 15)

In [4]:
df.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [5]:
# 平均身高
df['Height'].mean()

175.33896987366376

### group by

In [6]:
# 平均身高, per year
df.groupby('Year')['Height'].mean()

Year
1896    172.739130
1900    176.637931
1904    175.788732
1906    178.206226
1908    177.543158
1912    177.447989
1920    175.752282
1924    174.963039
1928    175.162051
1932    174.220115
1936    175.723993
1948    176.172797
1952    174.138940
1956    173.900968
1960    173.141286
1964    173.448574
1968    173.945865
1972    174.565363
1976    174.920528
1980    175.527488
1984    175.540855
1988    175.745252
1992    176.174649
1994    175.169862
1996    175.895121
1998    174.581369
2000    176.089721
2002    174.702451
2004    175.972850
2006    174.623172
2008    176.211062
2010    174.918182
2012    176.262469
2014    174.816670
2016    176.034266
Name: Height, dtype: float64

In [7]:
len(df.groupby('Year')['Height'].mean())

35

### pivot_table

In [8]:
# 平均身高, per year & per country （team）
df.pivot_table(index='Year', columns='Team', values='Height').shape

(35, 699)

In [9]:
# aggfunc: AggFuncType = "mean",
# df.pivot_table??

### pivot_table: transform

In [10]:
weather_df = pd.read_csv('./data/weather.csv')

In [11]:
weather_df

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60
3  5/1/2017    mumbai           75        80
4  5/2/2017    mumbai           78        83
5  5/3/2017    mumbai           82        85
6  5/1/2017   beijing           80        26
7  5/2/2017   beijing           77        30
8  5/3/2017   beijing           79        35

In [12]:
weather_df.pivot(index='city', columns='date')

         temperature                   humidity
date        5/1/2017 5/2/2017 5/3/2017 5/1/2017 5/2/2017 5/3/2017
city
beijing           80       77       79       26       30       35
mumbai            75       78       82       80       83       85
new york          65       66       68       56       58       60

In [14]:
weather_df.pivot(index='city', columns='date').columns

MultiIndex([('temperature', '5/1/2017'),
            ('temperature', '5/2/2017'),
            ('temperature', '5/3/2017'),
            (   'humidity', '5/1/2017'),
            (   'humidity', '5/2/2017'),
            (   'humidity', '5/3/2017')],
           names=[None, 'date'])

In [15]:
weather_df.pivot(index='city', columns='date').index

Index(['beijing', 'mumbai', 'new york'], dtype='object', name='city')

In [17]:
weather_df.pivot(index='city', columns='date', values='humidity')

date      5/1/2017  5/2/2017  5/3/2017
city
beijing         26        30        35
mumbai          80        83        85
new york        56        58        60

### pivot table

In [18]:
weather_df2 = pd.read_csv('./data/weather2.csv')

In [19]:
weather_df2

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/1/2017  new york           61        54
2  5/2/2017  new york           70        60
3  5/2/2017  new york           72        62
4  5/1/2017    mumbai           75        80
5  5/1/2017    mumbai           78        83
6  5/2/2017    mumbai           82        85
7  5/2/2017    mumbai           80        26

In [24]:
weather_df2.pivot_table(index='city', columns='date')

         humidity          temperature
date     5/1/2017 5/2/2017    5/1/2017 5/2/2017
city
mumbai       81.5     55.5        76.5     81.0
new york     55.0     61.0        63.0     71.0

In [20]:
weather_df2.pivot_table(index='city', columns='date', values='temperature')

date      5/1/2017  5/2/2017
city
mumbai        76.5      81.0
new york      63.0      71.0

In [22]:
(65 + 61)/2

63.0

### grouper obj as the index

In [25]:
weather_df3 = pd.read_csv('./data/weather3.csv')

In [29]:
weather_df3

        date      city  temperature  humidity
0   5/1/2017  new york           65        56
1   5/2/2017  new york           61        54
2   5/3/2017  new york           70        60
3  12/1/2017  new york           30        50
4  12/2/2017  new york           28        52
5  12/3/2017  new york           25        51

In [28]:
weather_df3['date']

0     5/1/2017
1     5/2/2017
2     5/3/2017
3    12/1/2017
4    12/2/2017
5    12/3/2017
Name: date, dtype: object

In [30]:
weather_df3['date'] = pd.to_datetime(weather_df3['date'])

In [31]:
weather_df3

        date      city  temperature  humidity
0 2017-05-01  new york           65        56
1 2017-05-02  new york           61        54
2 2017-05-03  new york           70        60
3 2017-12-01  new york           30        50
4 2017-12-02  new york           28        52
5 2017-12-03  new york           25        51

In [34]:
# ME: month end frequency 
weather_df3.pivot_table(index=pd.Grouper(freq='ME', key='date'), columns='city')

             humidity temperature
city         new york    new york
date
2017-05-31  56.666667   65.333333
2017-12-31  51.000000   27.666667